import re

raw_text = """กชมน อ่านว่า กด-ชะ-มน ความหมาย มีใจประเสริฐเหมือนดอกบัว
กนกรดา อ่านว่า กะ-หนก-ระ-ดา ความหมาย ยินดีในทอง
กรรวี อ่านว่า กอน-ระ-วี ความหมาย รัศมีแห่งพระอาทิตย์
กนกอร อ่านว่า กะ-หนก-ออน ความหมาย ผู้หญิงที่ดี
กันยนา อ่านว่า กัน-ยะ-นา ความหมาย หญิงสาว
กุลจิรา อ่านว่า กุน-จิ-รา ความหมาย มีตระกูลอันมั่นคง ตระกูลที่ตั้งอยู่ตลอดกาลนาน
กุลนิดา อ่านว่า กุน-นิ-ดา ความหมาย ผู้นำตระกูล ผู้ได้รับการแนะนำในตระกูล
กฤตินี อ่านว่า กริด-ติ-นี ความหมาย ผู้ที่ทำสำเร็จแล้ว
กัญญ์วรา อ่านว่า กัน-วะ-รา ความหมาย หญิงสาวผู้ประเสริฐ
กานต์พิชชา อ่านว่า กาน-พิด-ชา ความหมาย มีความรู้เป็นที่รัก
กิตติญา อ่านว่า กิด-ติ-ยา ความหมาย ผู้มีเกียรติ
กิตติญานภ อ่านว่า กิด-ติ-ยา-นบ ความหมาย มีชื่อเสียงและความรู้กว้างดั่งท้องฟ้า
กิตติธรา อ่านว่า กิด-ติ-ทะ-รา ความหมาย ทรงไว้ซึ่งเกียรติ
ขจีพร อ่านว่า ขะ-จี-พอน ความหมาย ผู้ประเสริฐงาม
ขรินทร์ทิพย์ อ่านว่า ขะ-ริน-ทิบ ความหมาย เทวดาผู้เป็นใหญ่และเก่งกล้า
ขวัญญดากร อ่านว่า ขวัน-ยะ-ดา-กอน ความหมาย ปราชญ์ผู้เป็นมิ่งขวัญ
ขวัญนรี อ่านว่าขวัน-นะ-รี ความหมาย มิ่งขวัญของหญิงสาว
ขวัญปติ อ่านว่า ขวัน-ปะ-ติ ความหมาย มิ่งขวัญแห่งความน่ายินดี
ขวัญพร อ่านว่า ขวัน-พอน ความหมาย มิ่งขวัญประเสริฐ
ขวัญพิชชา อ่านว่า ขวัน-พิด-ชา ความหมาย มีความรู้เป็นมิ่งขวัญ
ขวัญฤดี อ่านว่า ขวัน-รึ-ดี ความหมาย ยินดีในมิ่งมงคล
เขมิกา อ่านว่า เข-มิ-กา ความหมาย มีความเกษมสันต์
คัทยา อ่านว่า คัด-ทะ-ยา ความหมาย บทประพันธ์ ร้อยแก้ว
คัมภีรดา อ่านว่า คัม-ภี-ระ-ดา ความหมาย ผู้มีความฉลาดลึกซึ้ง เห็นการณ์ไกล
คัมภีรัตว์ อ่านว่า คัม-ภี-รัด ความหมาย ผู้มีความฉลาดลึกซึ้ง
คีติกา อ่านว่า คี-ติ-กา ความหมาย เพลงขับ การขับร้อง
จารวี อ่านว่า จา-ระ-วี ความหมาย ผู้งดงาม
จิณัฐตา อ่านว่า จิ-นัด-ตา ความหมาย ความเป็นผู้ฉลาดที่ได้สั่งสมมา
จิตชญา อ่านว่า จิด-ชะ-ยา ความหมาย รู้ใจผู้อื่น
จิตตินี อ่านว่า จิด-ติ-นี ความหมาย ผู้มีไหวพริบ
จิตรกัญญา อ่านว่า จิด-กัน-ยา ความหมาย หญิงสาวที่สวยงาม
ฉฎานันท์ อ่านว่า ฉะ-ดา-นัน ความหมาย ผู้มีความงามและความรื่นเริง
ฉันทพิชญา อ่านว่า ฉัน-ทะ-พิด-ชะ-ยา ความหมาย ผู้รู้แจ้งความพอใจ
ฉันทยา อ่านว่า ฉัน-ทะ-ยา ความหมาย พอใจ
ฉายรวี อ่านว่า ฉาย-ระ-วี ความหมาย งามดั่งตะวันเรืองแสง
ชรินทร์ทิพย์ อ่านว่า ชะ-ริน-ทิบ ความหมาย ยอดเป็นดี วิเศษ
ชัชชญา อ่านว่า ชัด-ชะ-ยา ความหมาย รู้รวดเร็ว รอบรู้
ชาคริยา อ่านว่า ชา-คริ-ยา ความหมาย ความเพียร ความตื่นตัวอยู่ตลอดเวลา
โชติมนต์ อ่านว่า โช-ติ-มน ความหมาย ประเสริฐในความรู้
ชุติญา อ่านว่า ชุ-ติ-ยา ความหมาย ความรู้รุ่งโรจน์
ชุติภา อ่านว่า ชุ-ติ-พา ความหมาย รัศมีรุ่งโรจน์
ชุติมณฑน์ อ่านว่า ชุ-ติ-มน ความหมาย มีความรุ่งเรืองเป็นเครื่องประดับ
ญาณธิชา อ่านว่า ยาน-ทิ-ชา ความหมาย เกิดมามีปัญญา
ญาณวดี อ่านว่า ยาน-นะ-วะ-ดี ความหมาย มีความสามารถหยั่งรู้
ญาณวิภา อ่านว่า ยาน-นะ-วิ-ภา ความหมาย รัศมีแห่งความรู้
ญาณิกา อ่านว่า นา-นิ-กา ความหมาย มีความรู้
ญาณิน อ่านว่า ยา-นิน ความหมาย ผู้มีความรู้
ฐานิฏฐ์ อ่านว่า ถา-นิด ความหมาย เป็นที่น่าพอใจ
ฐิตาภา อ่านว่า ถิ-ตา-พา ความหมาย มีรัศมีมั่นคง รุ่งเรืองนาน
ณัฐธยาน์ อ่านว่า นัด-ทะ-ยา ความหมาย การเพ่งพินิจของนักปราชญ์
ณัฐรินีย์ อ่านว่า นัด-ถะ-ริ-นี ความหมาย ผู้มีความรู้ดุจแก้ววิเศษ
ดลปพร อ่านว่า ดน-ปะ-พอน ความหมาย บันดาลให้เกิดสิริมงคล
ทรรวรีก์ อ่านว่า ทัน-วะ-รี ความหมาย ชื่อพระอินทร์
เทวิกา อ่านว่า เท-วิ-กา ความหมาย เทพธิดา
ธนัญญา อ่านว่า ทะ-นัน-ยา ความหมาย มีความรู้เรื่องทรัพย์
ธัญชนก อ่านว่า ทัน-ชะ-นก ความหมาย ให้เกิดสิริมงคล หรือให้เกิดโชค
ธัญวรินทร์ อ่านว่า ทัน-วะ-ริน ความหมาย โชคดีและประเสริฐยิ่ง
ธันยวีร์ อ่านว่า ทัน-ยะ-วี ความหมาย มีโชคและมีความกล้า
ธาริกา อ่านว่า ทา-ริ-กา ความหมาย ผู้อ่อนเยาว์
ธีรยา อ่านว่า ที-ระ-ยา ความหมาย ความฉลาด
นภาธร อ่านว่า นะ-พา-ทอน ความหมาย มั่นคงดั่งท้องฟ้า
นวินดา อ่านว่า นะ-วิน-ดา ความหมาย ความใหม่ ความสดชื่น
นันท์ชวัล อ่านว่า นัน-ชะ-วัน ความหมาย รุ่งเรืองน่ายินดี
นิชาภัทร อ่านว่า นิ-ชา-พัด ความหมาย เป็นของตัวเองและดีงาม
นิรณา อ่านว่า นิ-ระ-นา ความหมาย ร่าเริง ยินดี
นิรภัฎ อ่านว่า นิ-ระ-พัด ความหมาย มั่นคง แข็งแกร่ง
นราวดี อ่านว่า นะ-รา-วะ-ดี ความหมาย หญิงผู้ประเสริฐ
นวินดา อ่านว่า นะ-วิน-ดา ความหมาย ความใหม่ ความสดชื่น
นัทธ์ณมน อ่านว่า นัด-นะ-มน ความหมาย ผูกพันด้วยใจ
นิวาริน อ่านว่า นิ-วา-ริน ความหมาย ห้ามความชั่ว ป้องกันความชั่วร้าย
นีรชา อ่านว่า นี-ระ-ชา ความหมาย ดอกบัว
บุณยาพร อ่านว่า บุน-ยา-พอน ความหมาย ดีและประเสริฐ ประเสริฐด้วยความดี
เบญญาภา อ่านว่า เบน-ยา-พา ความหมาย รุ่งเรืองด้วยปัญญา
ปภาวี อ่านว่า ปะ-พา-วี ความหมาย ผู้มีอำนาจ
ปรียาดา อ่านว่า ปรี-ยา-ดา ความหมาย ความเป็นที่รัก
ปัณณ์ทิชา อ่านว่า ปัน-ทิ-ชา ความหมาย ผู้เกิดสองครั้งในความรู้
ปัทมนิภา อ่านว่า ปัด-ทะ-มะ-นิ-พา ความหมาย เปรียบได้ดังดอกบัว
ปุณิกา อ่านว่า ปุ-นิ-กา ความหมาย มีบุญ มีคุณงามความดี
เปรมา อ่านว่า เปร-มา ความหมาย รัก
พิชามญชุ์ อานว่า พิ-ชา-มน ความหมาย ผู้งดงามด้วยความรู้
เพ็ญนีติ์ อ่านว่า เพ็น-นี ความหมาย แสงจันทร์นำทาง
ภควรรณ อ่านว่า พะ-คะ-วัน ความหมาย ผิวพรรณดีมีโชคลาภ
รินรดา อ่านว่า ริน-ระ-ดา ความหมาย ผู้ยินดีหรือรื่นเริงอยู่เสมอ
อมลณดา อ่านว่า อะ-มน-นะ-ดา ความหมาย ผู้ปราศจากมลทิน
อรปรียา อ่านว่า ออน-ปรี-ยา ความหมาย นางผู้เป็นที่รัก
อาคิรา อ่านว่า อา-คิ-รา ความหมาย พระอาทิตย์

ชื่อจริงลูกสาว สำหรับคนเกิดวันจันทร์
กชอร อ่านว่า กด-ชะ-ออน ความหมาย หญิงงามดุจดอกบัว
กนกพร อ่านว่า กะ-หนก-พอน ความหมาย ทองประเสริฐ
กมลฉันท์ อ่านว่า กะ-มน-ฉัน ความหมาย ความพอใจ
กรภัทร์ อ่านว่า กอ-ระ-พัด ความหมาย มีโชค มีสิริมงคลในการกระทำ
กรภัทร อ่านว่า กอน-พัด ความหมาย มีโชค มีสิริมงคลในการกระทำ
กันยกร อ่านว่า กัน-ยะ-กอน ความหมาย สร้างสิริมงคล สร้างความสุขสมบูรณ์พูนสุข
จรรยมณฑน์ อ่านว่า จัน-ยา-มน ความหมาย ผู้มีความประพฤติดีเป็นเครื่องประดับ
จรรย์วรท อ่านว่า จัน-วะ-รด ความหมาย มีกิริยาที่ประเสริฐ
จันทรรัตน์ อ่านว่า จัน-ทระ-รัด ความหมาย ไข่มุก
ณภัทร อ่านว่า นะ-พัด ความหมาย ดีงามด้วยความรู้
ณหทัย อ่านว่า นะ-หะ-ไท ความหมาย หัวใจแห่งความรู้
ณัชชนม์ อ่านว่า นัด-ชน ความหมาย มีชีวิตอยู่อย่างปราชญ์
ณัฐวลัญช์ อ่านว่า นัด-วะ-ลัน ความหมาย เครื่องหมายของปราชญ์ ลักษณะของปราชญ์
ดรัลพร อ่านว่า ดะ-รัน-พอน ความหมาย ทับทิมอันประเสริฐ
ธมนต์ อ่านว่า ทะ-มน ความหมาย กำจัดมลทิน
ธมนวรรณ อ่านว่า ทะ-มน-วัน ความหมาย มีผิวพรรณสวยงาม
ธวัลพร อ่านว่า ทะ-วัน-พอน ความหมาย บริสุทธิ์และประเสริฐ
ธัญมล อ่านว่า ทัน-ยะ-มน ความหมาย มีใจดียิ่ง
ธันยชนก อ่านว่า ธัน-ยะ-ชะ-นก ความหมาย ให้เกิดโชคดี
ธันยมนย์ อ่านว่า ทัน-ยะ-มน ความหมาย คิดว่าตนเป็นผู้มีโชคลาภมีสุข
นพรรณพ อ่านว่า นะ-พัน-นบ ความหมาย ทะเลทั้ง ๙
นภัทร อ่านว่า นะ-พัด ความหมาย มีสิริมงคลและความรู้
นฤภัทร อ่านว่า นะ-รึ-พัด ความหมาย สิริมงคลแก่คน
นลัทพร อ่านว่า นะ-ลัด-ทะ-พอน ความหมาย น้ำผึ้ง ดอกไม้ที่ประเสริฐ
นัทธมน อ่านว่า นัด-ธะ-มน ความหมาย มีใจผูกพัน
นัทธ์หทัย อ่านว่า นัด-หะ-ไท ความหมาย ใจอันผูกพันไว้
นัยน์ภัค อ่านว่า ไน-ยะ-พัก ความหมาย ตาสวย
ปณตพร อ่านว่า ปะ-นด-พอน ความหมาย การน้อมไหว้อันประเสริฐ
ปภัสสร อ่านว่า ปะ-พัด-สอน ความหมาย แสงสว่าง
ปวรรัตน์ อ่านว่า ปะ-วอน-รัด ความหมาย รัตนะอันประเสริฐ
ปัณณพร อ่านว่า ปัน-นะ-พอน ความหมาย ประเสริฐทางหนังสือ
พณณกร อ่านว่า พัน-นะ-กอน ความหมาย มีผิวพรรณสวย
พรกรัณย์ อ่านว่า พอน-กะ-รัน ความหมาย มีการกระทำอันประเสริฐ มีกิจการอันประเสริฐ
พรรณปพร อ่านว่า พัน-ปะ-พอน ความหมาย มีผิวพรรณประเสริฐ
พรรณรมณ อ่านว่า พัน-ระ-มน ความหมาย มีผิวพรรณน่ายินดี
พรรณวรท อ่านว่า พัน-วะ-รด ความหมาย การให้พรเรื่องผิวพรรณงาม
พรรธน์ชญมน อ่านว่า พัด-ชะ-ยะ-มน ความหมาย ผู้มีใจงามมีความรู้และเจริญ
พรรษสร อ่านว่า พัด-สอน ความหมาย ฝนทิพย์
พรลภัส อ่านว่า พอน-ละ-พัด ความหมาย มีลาภอันประเสริฐ
พลอยรัตน์ อ่านว่า พลอย-รัด ความหมาย ประสมด้วยเพชรนิลจินดา
ภคนันท์ อ่านว่า พะ-คะ-นัน ความหมาย ยินดีในโชคหรือสิริมงคล
ภคพร อ่านว่า พะ-คะ-พอน ความหมาย มีโชคเป็นพร
ภคมน อ่านว่า พะ-คะ-มน ความหมาย จิตใจประกอบด้วยโชค
ภรณ์ชนก อ่านว่า พอน-ชะ-นก ความหมาย การเลี้ยงดูบิดา
ภัสสร อ่านว่า พัด-สอน ความหมาย รัศมีอันบริสุทธิ์
มนพร อ่านว่า มะ-นะ-พอน ความหมาย มีใจประเสริฐ
มนัสสร อ่านว่า มะ-นัด-สอน ความหมาย จิตใจดีงาม
ยศวลัย อ่านว่า ยด-สะ-วะ-ไล ความหมาย สีสันแห่งสิ่งใหม่ ๆ
รชธมน อ่านว่า ระ-ชะ-ทะ-มน ความหมาย ยิ่งใหญ่และมีใจงดงาม
รมณ อ่านว่า ระ-มน ความหมาย ยินดี รื่นเริง ความสุข
รัชมน อ่านว่า รัด-ชะ-มน ความหมาย ใจยิ่งใหญ่
วรภร อ่านว่า วอ-ระ-พอน ความหมาย ค้ำจุนสิ่งดี
วรมน อ่านว่า วอ-ระ-มน ความหมาย ใจดี
วรรณวนัช อ่านว่า วัน-วะ-นัด ความหมาย ผิวพรรณเหมือนดอกบัว
วรวลัญช์ อ่านว่า วอ-ระ-วะ-ลัน ความหมาย ผู้มีลักษณะอันประเสริฐ
วรันธร อ่านว่า วะ-รัน-ทอน ความหมาย ผู้ทรงไว้ซึ่งสิ่งประเสริฐ ทรงไว้ซึ่งพร
ศตพร อ่านว่า สะ-ตะ-พอน ความหมาย มีพรมากหรือมีความประเสริฐมากมาย
ศมนันท์ อ่านว่า สะ-มะ-นัน ความหมาย สุขสงบ
ศศธร อ่านว่า สะ-สะ-ทอน ความหมาย ดวงจันทร์
ศศพร อ่านว่า สะ-สะ-พอน ความหมาย พรจากพระจันทร์
สมภัสสร อ่านว่า สม-พัด-สอน ความหมาย รัศมีที่เหมาะควร
สวรรณ อ่านว่า สะ-วัน ความหมาย มีพรรณอย่างเดียวกัน
หทัยรัตน์ อ่านว่า หะ-ไท-รัด ความหมาย แก้วใจ
หรรษมน อ่านว่า หัด-สะ-มน ความหมาย ใจร่าเริง
องค์อร อ่านว่า อง-ออน ความหมาย หญิงสูงศักดิ์
อนัญพร อ่านว่า อะ-นัน-ยะ-พอน ความหมาย ไม่มีใครอื่นประเสริฐกว่า
อมล อ่านว่า อะ-มน ความหมาย ไม่มีมลทิน หรือผู้บริสุทธิ์
อมลวรรณ อ่านว่า อะ-มน-วัน ความหมาย มีผิวพรรณบริสุทธิ์
อรชพร อ่านว่า อะ-ระ-ชะ-พอน ความหมาย บริสุทธิ์ยิ่ง

ชื่อจริงลูกสาว สำหรับคนเกิดวันอังคาร
จารุนันท์ อ่านว่า จา-รุ-นัน ความหมาย ผู้ยินดีในความงาม ผู้ยินดีในสิ่งที่น่ารัก
จารุนิภา อ่านว่า จา-รุ-นิ-พา ความหมาย ดุจทอง
จิดาภา อ่านว่า จิ-ดา-พา ความหมาย รัศมีอันสะสมไว้แล้ว รุ่งเรืองมาก
จิตรวรรณ อ่านว่า จิด-ตะ-วัน ความหมาย ผู้มีผิวพรรณงดงาม
จินดารัตน์ อ่านว่า จิน-ดา-รัด ความหมาย มีความคิดที่วิเศษเป็นเลิศ
จิณห์วรา อ่านว่า จิน-วะ-รา ความหมาย มีเครื่องหมายหรือสัญลักษณ์อันประเสริฐ
จิรปรียา อ่านว่า จิ-ระ-ปรี-ยา ความหมาย ผู้เป็นที่รักตลอดกาล
จิณัฐตา อ่านว่า จิ-นัด-ตา ความหมาย ความเป็นผู้ฉลาดที่ได้สั่งสมมา
จริยาพร อ่านว่า จะ-ริ-ยา-พอน ความหมาย ความประพฤติดี
จริยาวดี อ่านว่า จะ-ริ-ยา-วะ-ดี ความหมาย หญิงผู้มีความประพฤติดี
จินต์จุฑา อ่านว่า จิน-จุ-ทา ความหมาย มีความคิดเด่น มีความคิดเป็นเลิศ
ชญานิศ อ่านว่า ชะ-ยา-นิด ความหมาย เจ้าแห่งความรู้ ยอดผู้รู้
ชญาภา อ่านว่า ชะ-ยา-พา ความหมาย ผู้มีราศีแห่งชัยชนะ
ชฎารัตน์ อ่านว่า ชะ-ดา-รัด ความหมาย มงกุฎแก้ว
ชนิตร์นันท์ อ่านว่า ชะ-นิด-นัน ความหมาย แหล่งกำเนิดความยินดี
ชนิศา อ่านว่า ชะ-นิ-สา ความหมาย ผู้เป็นใหญ่ในหมู่ชน
ชุติมณฑน์ อ่านว่า ชุ-ติ-มน ความหมาย มีความรุ่งเรืองเป็นเครื่องประดับ
ญาณิดา อ่านว่า ยา-นิ-ดา ความหมาย มีความรู้
ญาณิน อ่านว่า ยา-นิน ความหมาย ผู้มีความรู้
ญาดา อ่านว่า ยา-ดา ความหมาย ผู้รู้ นักปราชญ์
ฐปนีย์ อ่านว่า ถะ-ปะ-นี ความหมาย ผู้มีความตั้งมั่น
ฐิตารีย์ อ่านว่า ถิ-ตา-รี ความหมาย มั่นคงและประเสริฐ
ฐิติภา อ่านว่า ถิ-ติ-พา ความหมาย แสงสว่าง
ณธายุ อ่านว่า นะ-ทา-ยุ ความหมาย ให้ความรู้
ณัจยา อ่านว่า นัด-จะ-ยา ความหมาย การสะสมความรู้
ณัฐสินี อ่านว่า นัด-ถะ-สิ-นี ความหมาย หญิงผู้ฉลาด
ณิศวรา อ่านว่า นิด-สะ-วะ-รา ความหมาย ผู้เป็นใหญ่ในทางความรู้คือนักปราชญ์
เณศรา อ่านว่า เนด-สะ-รา ความหมาย ผู้เป็นใหญ่ในทางความรู้คือนักปราชญ์
ดรัลพร อ่านว่า ดะ-รัน-พอน ความหมาย ทับทิมอันประเสริฐ
ดารินทร์ อ่านว่า ดา-ริน ความหมาย ดวงดาวอันยิ่งใหญ่ ยอดดารา
ติณณา อ่านว่า ติน-นา ความหมาย ผู้ข้ามพ้นความทุกข์
ตีรณา อ่านว่า ตี-ระ-นา ความหมาย ปัญญาพิจารณา ไตร่ตรอง
ตุลยดา อ่านว่า ตุน-ยะ-ดา ความหมาย ความเสมอภาค
ทิษฏยา อ่านว่า ทิด-ตะ-ยา ความหมาย ที่โชคดีมีสิริมงคล
ธวัลยา อ่านว่า ทะ-วัน-ยา ความหมาย บริสุทธิ์
ธัญสิริ อ่านว่า ทัน-ยะ-สิ-หริ ความหมาย โชคดีและเป็นมิ่งขวัญ
ธีรยา อ่านว่า ที-ระ-ยา ความหมาย ความฉลาด
นภาลัย อ่านว่า นะ-พา-ลัย ความหมาย ฟากฟ้า
นรียา อ่านว่า นะ-รี-ยา ความหมาย สตรี
นันท์นพิน อ่านว่า นัน-ทะ-พิน ความหมาย ผู้มีความสุขใหม่ ๆ มีความสุขเสมอ
นิชานาถ อ่านว่า นิ-ชา-นาด ความหมาย มีที่พึ่งเป็นของตนเอง
นิพิษฐา อ่านว่า นิ-พิด-ถา ความหมาย ผู้ดำรงมั่น มั่นคง
นิรณรา อ่านว่า นิ-ระ-นะ-รา ความหมาย ชื่อพาหนะพระอาทิตย์
นิรัชพร อ่านว่า นิ-รัด-ชะ-พอน ความหมาย บริสุทธิ์และประเสริฐ
นิศารัตน์ อ่านว่า นิ-สา-รัด ความหมาย พระจันทร์
นีราภา อ่านว่า นี-รา-พา ความหมาย ประกายน้ำ สีน้ำ
ปทิตตา อ่านว่า ปะ-ทิด-ดา ความหมาย รุ่งเรืองแล้ว ส่องแสงแล้ว
ปัณยตา อ่านว่า ปัน-ยะ-ตา ความหมาย ควรแก่การสรรเสริญ
ปาลิดา อ่านว่า ปา-ลิ-ดา ความหมาย ผู้ที่ถูกคุ้มครองรักษา
ปุณณดา อ่านว่า ปุน-นะ-ดา ความหมาย ความสำเร็จสมบูรณ์
เมนิลา อ่านว่า เม-นิ-ลา ความหมาย ชื่อเจ้าหญิง
 

ชื่อจริงลูกสาว สำหรับคนเกิดวันพุธกลางวัน
(เกิดวันพุธเวลา 06.00 น. - เย็นวันพุธเวลา 17.59 น.) 
กันยนา อ่านว่า กัน-ยะ-นา ความหมาย หญิงสาว
กันย์สินี อ่านว่า กัน-สิ-นี ความหมาย สาวงามผู้ไร้โรค สาวงามผู้สามารถ
การติมา อ่านว่า กาน-ติ-มา ความหมาย งามน่ารัก
กวินนาถ อ่านว่า กะ-วิน-นาด ความหมาย ผู้มีที่พึ่งอันดีงาม
กิรณา อ่านว่า กิ-ระ-นา ความหมาย รัศมีเรืองรอง
ฐิตาภา อ่านว่า ถิ-ตา-พา ความหมาย มีรัศมีมั่นคง รุ่งเรืองนาน
ฑิตยา อ่านว่า ดิด-ตะ-ยา ความหมาย เก่งดังนักปราชญ์
ณยฎา อ่านว่า นะ-ยะ-ดา ความหมาย พื้นพิภพและมหาสมุทร
ณัฐรินีย์ อ่านว่า นัด-ถะ-ริ-นี ความหมาย ผู้มีความรู้ดุจแก้ววิเศษ
ดารัณ อ่านว่า ดา-รัน ความหมาย ชื่อพระศิวะ พระวิษณุ การเอาชนะความยากลำบาก
ธาพิดา อ่านว่า ทา-พิ-ดา ความหมาย สะอาด บริสุทธิ์แล้ว
ธินิดา อ่านว่า ทิ-นิ-ดา ความหมาย หญิงผู้มั่นคง
ธีรยา อ่านว่า ที-ระ-ยา ความหมาย ความฉลาด
นพิดา อ่านว่า นะ-พิ-ดา ความหมาย การสรรเสริญ
นวิยา อ่านว่า นะ-วิ-ยา ความหมาย สาวเสมอ สดชื่นเสมอ
นิรณา อ่านว่า นิ-ระ-นา ความหมาย ร่าเริง ยินดี
นิวรา อ่านว่า นิ-วะ-รา ความหมาย หญิงสาว
นุตประวีณ์ อ่าน่า นุด-ประ-วี ความหมาย นักปราชญ์ผู้ได้รับคำชมเชย
ปทิตตา อ่านว่า ปะ-ทิด-ดา ความหมาย รุ่งเรืองแล้ว ส่องแสงแล้ว
ปสุตา อ่านว่า ปะ-สุ-ตา ความหมาย ผู้ขยันขันแข็ง
ปัณยตา อ่านว่า ปัน-ยะ-ตา ความหมาย ควรแก่การสรรเสริญ
ปาลิกา อ่านว่า ปา-ลิ-กา ความหมาย ผู้รักษาผู้คุ้มครอง
พรรวินท์ อ่านว่า พอน-ระ-วิน ความหมาย ประเสริฐเหมือนดอกบัว

ชื่อจริงลูกสาว สำหรับคนเกิดวันพุธกลางคืน
(เกิดวันพุธเวลา 06.00 น. - เย็นวันพุธเวลา 17.59 น.) 
กนกนุช อ่านว่า กะ-หนก-นุช ความหมาย หญิงผู้มีค่าดั่งทองคำ
กนกลักษณ์ กะ-หนก-ลัก ความหมาย ลักษณะดุจทอง
กฤตยา อ่านว่า กริด-ตะ-ยา ความหมาย เกียรติ
กันยนา อ่านว่า กัน-ยะ-นา ความหมาย หญิงสาว
ขวัญจิรา อ่านว่า ขวัน-จิ-รา ความหมาย มีมิ่งขวัญตลอดกาลนาน
คริษฐา อ่านว่า คะ-ริด-ถา ความหมาย ผู้ที่น่าบูชาที่สุด
คันธารัตน์ อ่านว่า คัน-ทา-รัด ความหมาย กลิ่นแก้ว
คุณิตา อ่านว่า คุ-ณิ-ตา ความหมาย ผู้มีคุณงามความดี
จารีรัตน์ อ่านว่า จา-รี-รัด ความหมาย ผู้ประพฤติดี
จารุกัญญ์ อ่านว่า จา-รุ-กัน ความหมาย หญิงสาวที่งามดั่งทอง
จินต์จุฑา อ่านว่า จิน-จุ-ทา ความหมาย มีความคิดเด่น มีความคิดเป็นเลิศ
จิรชยา อ่านว่า จิ-ระ-ชะ-ยา ความหมาย มีชัยนาน
ฉันท์ชนก อ่านว่า ฉัน-ชะ-นก ความหมาย ผู้ให้เกิดความพอใจ
ชนัฐกานต์ อ่านว่า ชะ-นัด-กาน ความหมาย บุคคลอันเป็นที่รัก
ชยุตรา อ่านว่า ชะ-ยุด-ตรา ความหมาย มีชัยชนะอันประเสริฐสุด
ชลิตา อ่านว่า ชะ-ลิ-ตา ความหมาย ผู้รุ่งเรืองแล้ว
ชลิตา อ่านว่า ชะ-ลิ-ตา ความหมาย ผู้รุ่งเรืองแล้ว
ชาคริยา อ่านว่า ชา-คริ-ยา ความหมาย ความเพียร ความตื่นตัวอยู่ตลอดเวลา
ญาณิดา อ่านว่า ยา-นิ-ดา ความหมาย มีความรู้
ญาณิน อ่านว่า ยา-นิน ความหมาย ผู้มีความรู้
ญาตาวี อ่านว่า ยา-ตา-วี ความหมาย ผู้มีความรู้
ฐิติวรดา อ่านว่า ถิ-ติ-วอ-ระ-ดา ความหมาย มีวัตรมั่นคง มีความประพฤติมั่นคง
ณัฐกฤตา อ่านว่า นัด-กริ-ตา ความหมาย ผู้สร้างให้เป็นนักปราชญ์
ณัฐชยาน์ อ่านว่า นัด-ชะ-ยา ความหมาย การเพ่งพินิจของนักปราชญ์
ณิชากร อ่านว่า นิ-ชา-กอน ความหมาย บ่อเกิดแห่งสิ่งบริสุทธิ์
ติชิลา อ่านว่า ติ-ชิ-ลา ความหมาย พระจันทร์
ติณณา อ่านว่า ติน-นา ความหมาย ผู้ข้ามพ้นความทุกข์
ทัณฑิกา อ่านว่า ทัน-ทิ-กา ความหมาย ชื่อกาพย์ชนิดหนึ่ง
ธรณ์ธันย์ อ่านว่า ทอน-ทัน ความหมาย ทรงไว้ซึ่งโชคดี
ธีร์วรา อ่านว่า ที-วะ-รา ความหมาย นักปราชญ์ผู้ประเสริฐ
นราวดี อ่านว่า นะ-รา-วะ-ดี ความหมาย หญิงผู้ประเสริฐ
นลินญา อ่านว่า นะ-ลิน-ญา ความหมาย ดอกบัว
นวิยา อ่านว่า นะ-วิ-ยา ความหมาย สาวเสมอ สดชื่นเสมอ
นิชธาวัลย์ อ่านว่า นิด-ทา-วัน ความหมาย มีความบริสุทธิ์เป็นของตน มีความสุขเป็นนิรันดร
ยลรดา อ่านว่า ยน-ระ-ดา ความหมาย มองแล้วเกิดความยินดี
ยศสรัล อ่านว่า ยด-สะ-รัน ความหมาย ผู้มีเกียรติยศในความซื่อตรง
ยุวนิษฐ์ อ่านว่า ยุ-วะ-นิด ความหมาย หญิงสาวที่มีความมั่นคง
โยษิตา อ่านว่า โย - ษิ - ตา ความหมาย สตรี
ลักษณารีย์ อ่านว่า ลัก-สะ-นา-รี ความหมาย มีลักษณะประเสริฐ
ลัลน์ลลิต อ่านว่า ลัน-ละ-ลิด ความหมาย สาวสวย
วกุลทิพย์ อ่านว่า วะ-กุน-ทิบ ความหมาย ต้นพิกุลของเทวดา
วลีรัตน์ อ่านว่า วะ-ลี-รัด ความหมาย ถ้อยคำที่ไพเราะ
วาริธร อ่านว่า วา-ริ-ทอน ความหมาย เมฆ
เวธณี อ่านว่า เว - ทะ - นี ความหมาย สว่าง มีปัญญา เฉียบแหลม
ศศิชา อ่านว่า สะ-สิ-ชา ความหมาย เกิดจากดวงจันทร์ ดาวพุธ
ศิรญา อ่านว่า สิ-ระ-ยา ความหมาย มีปัญญาสุดยอด
โศจิรัตน์ อ่านว่า โส - สิ - รัด ความหมาย สุกใสบริสุทธิ์ดุจดวงแก้ว
สรัลชนา อ่านว่า สะ-รัน-ชะ-นา ความหมาย เป็นคนซื่อตรง
สิรกัญญา อ่านว่า สิ-ระ-กัน-ยา ความหมาย สาวน้อยผู้เป็นมิ่งขวัญ
อชิรชญา อ่านว่า อะ-ชิ-ระ-ชะ-ยา ความหมาย ฉลาดว่องไว
อธิญา อ่านว่า อะ-ทิ-ยา ความหมาย ผู้มีความรู้ดียิ่ง
อริสา อ่านว่า อะ-ริ-สา ความหมาย ผู้เป็นใหญ่เหนือศัตรู
 

ชื่อจริงลูกสาว สำหรับคนเกิดวันพฤหัสบดี
กมลพิชญ์ อ่านว่า กะ-มน-พิด ความหมาย ใจนักปราชญ์
กรวรรณ อ่านว่า กอน-รา-วัน ความหมาย มีผิวพรรณงดงาม
กวิสรา อ่าน่า กะ-วิ-สะ-รา ความหมาย จอมกวี ยอดผู้ฉลาด
กิรณา อ่านว่า กิ-ระ-นา ความหมาย รัศมีเรืองรอง
กุลิสรา อ่านว่า กุ-ลิด-สะ-รา ความหมาย ผู้เป็นใหญ่ในตระกูล
เกสรา อ่านว่า เกด-สะ-รา ความหมาย ผู้มีความงามดั่งเกสรดอกไม้
โกลัญญา อ่านว่า โก-ลัน-ยา ความหมาย สตรีผู้เกิดในตระกูลสูง
ขจีพร อ่านว่า ขะ-จี-พอน ความหมาย ผู้ประเสริฐงาม
เขมจิรา อ่านว่า เขม-จิ-รา ความหมาย มีความปลอดภัยตลอดกาลนาน
คริษฐา อ่านว่า คะ-ริด-ถา ความหมาย ผู้ที่น่าบูชาที่สุด
จิณห์วรา อ่านว่า จิน-วะ-รา ความหมาย มีเครื่องหมายหรือสัญลักษณ์อันประเสริฐ
จิรปรียา อ่านว่า จิ-ระ-ปรี-ยา ความหมาย ผู้เป็นที่รักตลอดกาล
จีรวรรณ อ่านว่า จี-ระ-วัน ความหมาย ผู้สวยนาน
จุฬาลักษณ์ อ่านว่า จุ-ลา-ลัก ความหมาย มีลักษณะเลิศโฉมงาม
ชญาภา อ่านว่า ชะ-ยา-พา ความหมาย ผู้มีราศีแห่งชัยชนะ
ชัญญา อ่านว่า ชัน-ยา ความหมาย ผู้ประเสริฐ ผู้รู้
ญภา อ่านว่า ยะ-พา ความหมาย รัศมีดาวพระศุกร์
ญาณิศา อ่านว่า ยา-นิ-สา ความหมาย เป็นใหญ่ด้วยความรู้
ฐิรญา อ่านว่า ถิ-ระ-ยา ความหมาย มีความรู้ยั่งยืน
ณยฎา อ่านว่า นะ-ยะ-ดา ความหมาย พื้นพิภพและมหาสมุทร
ณัฐพัชร์ อ่านว่า นัด-ถะ-พัด ความหมาย มีความรู้ดุจเพชร
ณิชกมล อ่านว่า นิด-กะ-มน ความหมาย ลูกนักปราชญ์
ณิชกุล อ่านว่า นิด-ชะ-กุน ความหมาย ตระกูลที่บริสุทธิ์
ณิชา อ่านว่า นิ-ชา ความหมาย สะอาด บริสุทธิ์
ณิศรา อ่านว่า นิด-สะ-รา ความหมาย เป็นใหญ่ทางความรู้
บุณยวีร์ อ่านว่า บุน-ยะ-วี ความหมาย ดีและกล้าหาญ
บุปผบฎ อ่านว่า บุบ-ผะ-บด ความหมาย ผ้าประดับดอกไม้
ปณัฏฎา อ่านว่า ปะ-นัด-ดา ความหมาย นักปราชญ์
ปพิชญา อ่านว่า ปะ-พิด-ชะ-ยา ความหมาย ผู้รู้แจ้ง
ปภาวี อ่านว่า ปะ-พา-วี ความหมาย ผู้มีอำนาจ
ปริยากร อ่านว่า ปะ-ริ-ยา-กอน ความหมาย บ่อเกิดแห่งสิ่งที่รัก
ปัณฑา อ่านว่า ปัน-ดา ความหมาย ปัญญา
ปาณิสรา อ่านว่า ปา-นิ-สะ-รา ความหมาย เจ้าแห่งชีวิต
ปาริมา อ่านว่า ปา-ริ-มา ความหมาย สามารถทำสำเร็จ
ไปรยา อ่านว่า ไป-ระ-ยา ความหมาย ผู้เป็นที่รัก
พชิรา อ่านว่า พะ-ชิ-รา ความหมาย เพชร
พริมา อ่านว่า พะ-ริ-มา ความหมาย ประเสริฐ ดีเยี่ยม
มิรา อ่านว่า มิ-รา ความหมาย ผู้มีความยิ่งใหญ่ดุจมหาสมุทร
ไรยา อ่านว่า ไร-ยา ความหมาย ปรารถนาทรัพย์สมบัติ
ลักษิกา อ่านว่า ลัก-สิ-กา ความหมาย สตรีผู้มีบุญวาสนา
วริศรา อ่านว่า วะ-ริด-สะ-รา ความหมาย ผู้ประเสริฐและเป็นใหญ่
สรชา อ่านว่า สอ-ระ-ชา ความหมาย ผู้มีบารมีสูงประเสริฐยิ่ง
สาริศา อ่านว่า สา-ริ-สา ความหมาย เจ้าแห่งแก่นสาร
สุภัควี อ่านว่า สุ-พัก-คะ-วี ความหมาย ผู้มีโชค
อรปรียา อ่านว่า ออน-ปรี-ยา ความหมาย นางผู้เป็นที่รัก
อัคริมา อ่านว่า อัก-คริ-มา ความหมาย เป็นใหญ่
 

ชื่อจริงลูกสาว สำหรับคนเกิดวันศุกร์
กชนิภา อ่านว่า กด-ชะ-นิ-พา ความหมาย เสมือนดอกบัว บริสุทธิ์เหมือนดอกบัว
กนิษฐา อ่านว่า กะ-นิด-ถา ความหมาย น้องสาวคนเล็ก
กฤตินี อ่านว่า กริด-ติ-นี ความหมาย ผู้ที่ทำสำเร็จแล้ว
กัญญชุดา อ่านว่า กัน-ยะ-ชุ-ดา ความหมาย หญิงผู้มีความรุ่งเรือง
กาญจน์ณัฏฐา อ่านว่า กาน-นัด-ถา ความหมาย ปราชญ์ผู้มีค่าดั่งทองคำ
กานต์พิชชา อ่านว่า กาน-พิด-ชา ความหมาย มีความรู้เป็นที่รัก
เกณิกา อ่านว่า เก-นิ-กา ความหมาย พลับพลาที่ประทับของพระราชา
คคนางค์ อ่านว่า คะ-คะ-นาง ความหมาย ท้องฟ้า
คุณิตา อ่านว่า คุ-นิ-ตา ความหมาย ผู้มีคุณงามความดี
จิณณพัต อ่านว่า จิน-นะ-พัด ความหมาย ผู้ประพฤติตามระเบียบแบบแผน
ชฎาพันธ์ อ่านว่า ชะ-ดา-พัน ความหมาย กลุ่มชฎา
ชนัญชิดา อ่านว่า ชะ-นัน-ธิ-ดา ความหมาย ผู้ชนะคนอื่น
ชิษณุชา อ่านว่า ชิด-สะ-นุ-ชา ความหมาย เกิดจากผู้ชนะ
ญาณิน อ่านว่า ยา-นิน ความหมาย ผู้มีความรู้
ญาณิศา อ่านว่า ยา-นิ-สา ความหมาย เป็นใหญ่ด้วยความรู้
ญาณี อ่านว่า ยา-นี ความหมาย ผู้มีความรู้
ญาดา อ่านว่า ยา-ดา ความหมาย ผู้รู้นักปราชญ์
ญาตา อ่านว่า ยา-ตา ความหมาย เป็นที่รู้จักกันดี
ฐานิฏฐ์ อ่านว่า ถา-นิด ความหมาย เป็นที่น่าพอใจ
ฐานิตา อ่านว่า ถา-นิ-ตา ความหมาย ผู้มีฐานะ
ณัฐกฤตา อ่านว่า นัด-กริด-ตา ความหมาย ผู้สร้างให้เป็นนักปราชญ์
ณิชนันทน์ อ่านว่า นิด-ชะ-นัน ความหมาย เพลิดเพลินยินดีในสิ่งที่บริสุทธิ์
ทิพปภา อ่านว่า พิบ-ปะ-พา ความหมาย รุ่งเรืองดียิ่ง
ทิพานัน อ่านว่า ทิ-พา-นัน ความหมาย ผู้มีใบหน้าสวยงาม
ธมน อ่านว่า ทะ-มน ความหมาย กำจัดมลทิน สวย
ธิษณา อ่านว่า ทิด-สะ-นา ความหมาย ฉลาด หลักแหลม
นิกข์นิภา อ่านว่า นิก-นิ-พา ความหมาย เสมือนแห่งทอง
นิฏฐา อ่านว่า นิด-ถา ความหมาย สำเร็จ
นิษฐา อ่านว่า นิด-ถา ความหมาย สำเร็จ สมบูรณ์ จุดหมายปลายทาง
บัณฑิตา อ่านว่า บัน-ดิ-ตา ความหมาย ผู้ฉลาด, ผู้มีความรู้
บุณิกา อ่านว่า บุ-นิ-กา ความหมาย ผู้ใจบุญ ผู้ทรงคุณธรรม
เบญญา อ่านว่า เบน-ยา ความหมาย ฉลาด
เบญญาภา อ่านว่า เบน-ยา-พา ความหมาย รุ่งเรืองด้วยปัญญา
ปณิตา อ่านว่า ปะ-นิ-ตา ความหมาย ได้รับการสรรเสริญ ประณีต
ปุณณดา อ่านว่า ปุน-นะ-ดา ความหมาย ความสำเร็จสมบูรณ์
ปุณิกา อ่านว่า ปุ-นิ-กา ความหมาย มีบุญ มีคุณงามความดี
เปมิกา อ่านว่า เป-มิ-กา ความหมาย ผู้มีความรัก ผู้เป็นที่รัก
พิจักขณา อ่านว่า พิ-จัก-ขะ-นา ความหมาย มีปัญญาเห็นประจักษ์ ผู้ฉลาดยิ่ง
พิชญาภา อ่านว่า พิด-ชะ-ยา-พา ความหมาย แสงสว่างของนักปราชญ์
มานิดา อ่านว่า มา-นิ-ดา ความหมาย ผู้ที่คนนับถือ
เมธินี อ่านว่า เม-ทิ-นี ความหมาย ปราชญ์สตรี
โศภิตา อ่านว่า โส-พิ-ตา ความหมาย นางงาม
สุทัชชา อ่านว่า สุ-ทัด-ชา ความหมาย ผู้ให้สิ่งดี
อติกานต์ อ่านว่า อะ-ติ-กาน ความหมาย เป็นที่รักยิ่ง
อติญา อ่านว่า อะ-ติ-ยา ความหมาย พิเศษ
อตินุช อ่านว่า อะ-ติ-นุด ความหมาย หญิงสาวผู้ยิ่งใหญ่
อนันตญา อ่านว่า อะ-นัน-ตะ-ยา ความหมาย ผู้รู้ไม่สิ้นสุด
 

ชื่อจริงลูกสาว สำหรับคนเกิดวันเสาร์
กวิสรา อ่านวาา กะ-วิ-สะ-รา ความหมาย จอมกวี ยอดผู้ฉลาด
กัญญ์วรา อ่านว่า กัน-วะ-รา ความหมาย หญิงสาวผู้ประเสริฐ
กัญญาภัค อ่านว่า กัน-ยา-พัก ความหมาย หญิงสาวผู้มีศิริมงคล
กันย์สินี อานว่า กัน-สิ-นี ความหมาย สาวงามผู้ไร้โรค
กานต์รวี อ่านว่า กาน-ระ-วี ความหมาย พระอาทิตย์ที่น่ารัก พระอาทิตย์งดงาม
เขมินทรา อ่านว่า เข-มิน-ทรา ความหมาย มีความเกษมอันยิ่งใหญ่ ปลอดภัย
คะนึงนิตย์ อ่านว่า คะ-นึง-นิด ความหมาย คิดทบทวนอยู่ตลอด คิดถึงอยู่ตลอด
จิรปรียา อ่านว่า จิ-ระ-ปรี-ยา ความหมาย ผู้เป็นที่รักตลอดกาล
จิรภิญญา อ่านว่า จิ-ระ-พิน-ยา ความหมาย ความรู้ยั่งยืน
ชญาภา อ่านว่า ชะ-ยา-พา ความหมาย ผู้มีราศีแห่งชัยชนะ
ชนัญชิดา อ่านว่า ชะ-นัน-ธิ-ดา ความหมาย ผู้ชนะคนอื่น
ชนิศา อ่านว่า ชะ-นิ-สา ความหมาย ผู้เป็นใหญ่ในหมู่ชน
ชัชชญา อ่านว่า ชัด-ชะ-ยา ความหมาย รู้รวดเร็ว รอบรู้
ชาคริยา อ่านว่า ชา-คริ-ยา ความหมาย ความเพียร ความตื่นตัวอยู่ตลอดเวลา
ชุติภา อ่านว่า ชุ-ติ-พา ความหมาย รัศมีรุ่งโรจน์
ญาตาวี อ่านว่า ยา-ตา-วี ความหมาย ผู้มีความรู้
ดนิตา อ่านว่า ดะ-นิ-ตา ความหมาย ผู้สำเร็จผลสมบูรณ์
ดมิสา อ่านว่า ดะ-มิ-สา ความหมาย เจ้าเหนือความมืด พระจันทร์
ธยาดา อ่านว่า ทะ-ยา-ดา ความหมาย คิดถึง คิดคำนึง
ธารินันท์ อ่านว่า ทา-ริ-นัน ความหมาย ความสดชื่นรื่นเริง
ธิษตยา อ่านว่า ทิด-ตะ-ยา ความหมาย รู้ด้วยใจ
ธีรตา อ่านว่า ที-ระ-ตา ความหมาย ยินดีในความรู้ ความเป็นนักปราชญ์
นพิดา อ่านว่า นะ-พิ-ดา ความหมาย การสรรเสริญ
นรมน อ่านว่า นอ-ระ-มน ความหมาย เป็นดวงใจของคนทั้งหลาย เป็นที่รักของคน
นันท์นลิน อ่านว่า นัน-นะ-ลิน ความหมาย บัวงาม น่าเพลิดเพลินดุจดอกบัว
นารา อ่านว่า นา-รา ความหมาย รัศมีรุ่งเรือง
นุชวรา อ่านว่า นุด-วะ-รา ความหมาย หญิงสาวผู้ประเสริฐ
บงกชรัตน์ อ่านว่า บง-กต-รัต ความหมาย ดอกบัวแก้ว
บวรกานต์ อ่านว่า บะ-วอน-กาน ความหมาย ผู้เป็นที่รักอันประเสริฐ
เบญจพร อ่านว่า เบน-จะ-พอน ความหมาย พร 5 ประการ
ปภาดา อ่านว่า ปะ-พา-ดา ความหมาย รุ่งเรืองแล้ว
ปรางทิพย์ อ่านว่า ปราง-ทิบ ความหมาย แก้มงาม , มะปรางแก้ว
ปราญชลี อ่านว่า ปราด-ชะ-ลี ความหมาย กระพุ่มมือไหว้ นอบน้อมถ่อมตน
ปริยฉัตร อ่านว่า ปะ-ริ-ยะ-ฉัด ความหมาย ฉัตรเป็นที่รัก
ปริยากร อ่านว่า ปริ-ยา-กอน ความหมาย บ่อเกิดแห่งสิ่งที่รัก มีเสน่ห์
ปสุตา อ่านว่า ปะ-สุ-ตา ความหมาย ผู้ขยันขันแข็ง
ปุญญิศา อ่านว่า ปุน-ยิ-สา ความหมาย ผู้มีบุญยิ่งใหญ่
พรลภัส อ่านว่า พอน-ละ-พัด ความหมาย มีลาภอันประเสริฐ
ภคนางค์ อ่านว่า พะ-คะ-นาง ความหมาย ผู้มีร่างกายนำโชค
ภรภัทร อ่านว่า พร-พัด ความหมาย ผู้ค้ำจุนที่ประเสริฐ
ภวิกา อ่านว่า พะ-วิ-กา ความหมาย มีความเจริญ
โยษิตา อ่านว่า โย-ษิ-ตา ความหมาย สตรี
รมิตา อ่านว่า ระ-มิ-ตา ความหมาย ผู้รื่นรมย์ ผู้มีความสุข
รวิภา อ่านว่า ระ-วิ-พา ความหมาย แสงอาทิตย์ หรือรุ่งเรืองดุจพระอาทิตย์
รินรดา อ่านว่า ริน-ระ-ดา ความหมาย ผู้ยินดี หรือ รื่นเริงอยู่เสมอ
ลัลน์ลลิต อ่านว่า ลัน-ละ-ลิด ความหมาย สาวสวย
วรวลัญช์ อ่านว่า วอ-ระ-วะ-ลัน ความหมาย ผู้มีลักษณะอันประเสริฐ
วรันธร อ่านว่า วะ-รัน-ทอน ความหมาย ผู้ทรงไว้ซึ่งสิ่งประเสริฐ
ศุภรดา อ่านว่า สุบ-พะ-ระ-ดา ความหมาย ขาวสะอาด
สาธินี อ่านว่า สา-ทิ-นี ความหมาย ให้สำเร็จ
สิรี อ่านว่า สิ-รี ความหมาย ศรี
"""

result = re.findall(r'^(.*?)\s+อ่านว่า', raw_text, re.MULTILINE)
print(result)
file_path = 'ชื่อคน500.txt'

with open(file_path, 'w', encoding='utf-8') as file:
    for item in result:
        file.write(item + '\n')

print(f'Data written to {file_path}')